import '@/app/styles/TermsAndPrivacy.css'

const page = () => {
    const policyTerms = [
        '-: باستخدام هذا التطبيق، فإنك توافق على الشروط والأحكام التالية',
        'اخبار وخدمات السعوديه  - قارئ إخباري مستقل لا يتحمل أي مسؤولية قانونية عن المواد المنشورة فيه لانها لا تعبر عن رأي الموقع',
        'يجب عليك استخدام التطبيق فقط للأغراض القانونية .',
        'لا يجوز لك استخدام التطبيق لنقل أي محتوى غير قانوني.',
        'نحتفظ بالحق في تعديل هذه الشروط والأحكام في أي وقت ودون إشعار مسبق.',
        'يُعتبر استمرار استخدامك للتطبيق بعد أي تعديل للشروط والأحكام موافقة صريحة منك على التعديلات.',
      ];
  return (
    <div className="policy-terms" style={style}>
    <h2>شروط الاستخدام والخصوصية</h2>
    <ul>
      {policyTerms.map((term, index) => (
        <li key={index}>{term}</li>
      ))}
    </ul>
  </div>
  )
}

export default page